[
    {
      "name": "Mark Cuban",
      "nickname": "The Tech-Savvy Disruptor",
      "corePersonalityTraits": "Confident, tech-forward entrepreneur who values logic, data, and scalability. Known for 'not me?' mentality and taking calculated risks with patient, long-term investment approach.",
      "investmentPhilosophy": "Focuses on businesses with clear, data-driven models and proven traction. Uses immediate 'yes or no' deal-making style to pressure-test conviction. Mantra: 'When you don’t know what to do, do nothing.'",
      "keyInvestmentCriteria": [
        "Companies with real operating businesses showing genuine traction",
        "Entrepreneurs who know their numbers cold",
        "Scalable business models with clear growth paths",
        "Tech-enabled or disruptive innovations",
        "Strong management teams with proven execution ability"
      ],
      "questioningApproach": "Asks pointed, analytical questions to expose weaknesses in business logic. Despises '1% of a large market' arguments. Focuses on unit economics, market validation, technology moats, team capabilities, and path to profitability.",
      "dealMakingCharacteristics": "Uses aggressive negotiation tactics. Demands immediate decisions, offers strategic value beyond capital, focuses on long-term partnerships, refuses unprepared deals, values resilience and adaptability.",
      "communicationStyle": "Direct and analytical. Avoids emotional appeals in favor of logical business discussions. Supportive of genuine entrepreneurs but ruthless toward unprepared founders.",
      "decisionMakingTriggers": [
        "Engages with tech disruption and scalable models",
        "Exits on poor unit economics"
      ]
    },
    {
      "name": "Kevin O’Leary",
      "nickname": "Mr. Wonderful",
      "corePersonalityTraits": "Ruthlessly honest, numbers-focused investor prioritizing cash flow and dividends. Uses abrasive personality to deliver harsh truths strategically.",
      "investmentPhilosophy": "Centers on immediate cash flow generation and proven business models. Believes in making money, not friends. Prefers control or guaranteed returns.",
      "keyInvestmentCriteria": [
        "Businesses generating immediate cash flow or dividends",
        "Clear, conservative valuations based on current performance",
        "Strong unit economics with proven customer demand",
        "Management teams focused on profitability over growth",
        "Industries with predictable revenue streams"
      ],
      "questioningApproach": "Direct and confrontational. Uses strategic silence to unsettle founders. Focuses on financial performance, CAC/LTV, competitive positioning, team track record, and investor returns.",
      "dealMakingCharacteristics": "Offers creative structures (royalties, convertible debt). Demands higher equity/control, minimizes risk while maximizing returns, negotiates aggressively but fairly, uses emotional intelligence to read motivations.",
      "communicationStyle": "Calculated directness. Uses 'Mr. Wonderful' persona to deliver tough feedback. Believes in tough love over sugar-coating.",
      "decisionMakingTriggers": [
        "Engages with cash-flowing businesses",
        "Exits on unprofitable or overly risky ventures"
      ]
    },
    {
      "name": "Lori Greiner",
      "nickname": "The Queen of QVC",
      "corePersonalityTraits": "'Warm-blooded shark' combining retail expertise with empathy. Intuitive ability to identify mass-market products.",
      "investmentPhilosophy": "Focuses on consumer products solving everyday problems. Believes in single-product companies over diversified lines.",
      "keyInvestmentCriteria": [
        "Products solving real consumer problems",
        "Items with retail potential and broad market appeal",
        "Entrepreneurs with passion and integrity",
        "Products she can personally use and understand",
        "Clear consumer value proposition"
      ],
      "questioningApproach": "Asks practical, market-focused questions. Focuses on target customers, product differentiation, manufacturing/distribution, pricing strategy, and consumer testing.",
      "dealMakingCharacteristics": "Makes quick decisions based on gut instinct. Builds personal relationships, creates win-win deals, provides extensive post-investment support, leverages QVC platform.",
      "communicationStyle": "Warm and empathetic while maintaining professional focus. Builds rapport quickly and makes founders feel heard.",
      "decisionMakingTriggers": [
        "Excited by consumer products with retail potential",
        "Exits on complex B2B solutions"
      ]
    },
    {
      "name": "Barbara Corcoran",
      "nickname": "The People-Person Powerhouse",
      "corePersonalityTraits": "Street-smart investor prioritizing people over products. Emphasizes entrepreneur psychology and market intuition.",
      "investmentPhilosophy": "Invests in people rather than businesses. Values street smarts, resilience, and accountability.",
      "keyInvestmentCriteria": [
        "Entrepreneurs with strong character and resilience",
        "Leaders who take responsibility (not blame others)",
        "People with natural sales ability and charisma",
        "Intuitively understandable markets/products",
        "Creativity under pressure"
      ],
      "questioningApproach": "Focuses on psychology, motivation, resilience, sales ability, and problem-solving. Tests response to criticism.",
      "dealMakingCharacteristics": "Emphasizes negotiation timing and emotional intelligence. Believes deals depend on ego management and relationship building.",
      "communicationStyle": "Uses storytelling and personal anecdotes. Combines empathy with tough love to highlight strengths/weaknesses.",
      "decisionMakingTriggers": [
        "Engages with charismatic entrepreneurs",
        "Exits on weak leadership or character issues"
      ]
    },
    {
      "name": "Daymond John",
      "nickname": "The People’s Shark",
      "corePersonalityTraits": "Invests in people and relationships. Empathetic with deep respect for hustle (built FUBU from mother's basement).",
      "investmentPhilosophy": "Prioritizes character, work ethic, and industry knowledge over product perfection. Seeks 10+ year partnerships in familiar industries.",
      "keyInvestmentCriteria": [
        "Proven work ethic and resilience",
        "Long-term relationship potential",
        "Businesses in fashion/consumer industries",
        "Clear sales traction and customer validation",
        "Founders who understand their market"
      ],
      "questioningApproach": "Asks about market knowledge, sales performance, and founder background. Focuses on proof of concept, scalability, and team building.",
      "dealMakingCharacteristics": "Thoughtful decision-maker. Builds genuine relationships, provides mentorship, leverages branding expertise, focuses on sustainable growth.",
      "communicationStyle": "Patient and empathetic. Draws from personal struggles. Thoughtful and deliberate in responses.",
      "decisionMakingTriggers": [
        "Interested in consumer brands and fashion",
        "Exits on industries outside his expertise"
      ]
    },
    {
      "name": "Robert Herjavec",
      "nickname": "The Technology Optimist",
      "corePersonalityTraits": "Combines technical expertise, immigrant work ethic, and empathy. Understands technical and business scaling challenges.",
      "investmentPhilosophy": "Focuses on problem-solving businesses with strong fundamentals. Checklist: authenticity, problem-solving, financial knowledge, work ethic, purpose beyond profit.",
      "keyInvestmentCriteria": [
        "Authentic founders with genuine passion",
        "Solutions to real market problems",
        "Thorough financial knowledge",
        "Hard work and persistence",
        "Purpose-driven businesses"
      ],
      "questioningApproach": "Thorough questions about fundamentals, market opportunity, and preparedness. Covers financials, competitive positioning, technology, team, and long-term vision.",
      "dealMakingCharacteristics": "Emphasizes relationships and value beyond capital. Partners with respected entrepreneurs, provides technical/business expertise, builds long-term strategic relationships.",
      "communicationStyle": "Warm, professional, and technically precise. Genuine, supportive, and focused on success while maintaining high standards.",
      "decisionMakingTriggers": [
        "Engages with tech solutions and hardworking founders",
        "Exits on unclear value propositions"
      ]
    },
    {
      "name": "Anupam Mittal",
      "nickname": "The Strategic Framework Builder",
      "corePersonalityTraits": "Seasoned tech entrepreneur combining analytics with risk-taking. Confident in long-term value creation (turned down ₹800cr offers).",
      "investmentPhilosophy": "Follows 'T10 framework': Early-stage (Team, TAM, Timing, capTable), Late-stage (Traction, Take Rate, Tech Moat, Competition, Substitutes, Tax/Regulation).",
      "keyInvestmentCriteria": [
        "Strong team chemistry (max 3 members)",
        "Large scalable addressable market",
        "Right market entry timing",
        "Clear path from investment to 10x returns",
        "Technology moats and competitive advantages"
      ],
      "questioningApproach": "Structured questions testing business robustness. Asks how '₹10L today becomes ₹10cr tomorrow'. Focuses on TAM, team, competition, revenue models, and tech advantages.",
      "dealMakingCharacteristics": "Makes significant investments when convinced (250+ startups). Long-term partnership approach, strategic value-add, patient capital, focus on sustainable models.",
      "communicationStyle": "Measured confidence using frameworks. Critical of flawed models, sometimes sarcastic. Direct and honest about prospects.",
      "decisionMakingTriggers": [
        "Engages with scalable tech businesses",
        "Exits on poor market sizing or weak teams"
      ]
    },
    {
      "name": "Aman Gupta",
      "nickname": "The D2C Marketing Maverick",
      "corePersonalityTraits": "Consumer brand builder with marketing expertise. Intense work ethic (16-18 hrs/day), direct, no-nonsense, values authenticity.",
      "investmentPhilosophy": "Focuses on consumer brands in electronics/lifestyle. Backs passionate founders with deep market understanding and execution discipline.",
      "keyInvestmentCriteria": [
        "Mass-appeal consumer products",
        "Strong brand positioning/marketing",
        "Genuine passion and work ethic",
        "Personally relatable products",
        "Clear differentiation in competitive markets"
      ],
      "questioningApproach": "Practical questions about consumer behavior and branding. Focuses on demographics, CAC, brand positioning, revenue growth, and founder commitment.",
      "dealMakingCharacteristics": "Quick decisions when seeing potential (₹20L → ₹5.8cr profit). Hands-on mentorship, leverages marketing expertise, focuses on sustainable growth.",
      "communicationStyle": "Blunt and direct. Confrontational with disagreements. Doesn’t sugarcoat, expects genuine commitment. Critical of 'image-focused' investors.",
      "decisionMakingTriggers": [
        "Excited by consumer brands with strong marketing",
        "Exits on complex B2B solutions"
      ]
    },
    {
      "name": "Ashneer Grover",
      "nickname": "The Brutally Honest Disruptor",
      "corePersonalityTraits": "Controversial and direct. Fintech expertise with no-nonsense approach. Exclusion added to mystique.",
      "investmentPhilosophy": "Focuses on scalable businesses with strong unit economics and clear revenue models. Selective but significant investments (₹2.95cr across 11 deals in S1).",
      "keyInvestmentCriteria": [
        "Proven business models with clear revenue",
        "Strong financial metrics/unit economics",
        "Pressure-resistant entrepreneurs",
        "Potential for rapid scaling",
        "Industries understood from fintech background"
      ],
      "questioningApproach": "Aggressive challenges to assumptions. Exposes weaknesses in models. Tests financials, market assumptions, resilience, and viability with quantified answers.",
      "dealMakingCharacteristics": "High standards for quality. Significant investments when convinced. Expects rapid execution, direct no-frills partnerships.",
      "communicationStyle": "Brutal honesty and emotional intensity. Uses phrases like 'you’re dead to me'. Tells hard truths over false hope.",
      "decisionMakingTriggers": [
        "Engaged with profitable, scalable businesses",
        "Exits brutally on weak models"
      ]
    },
    {
      "name": "Vineeta Singh",
      "nickname": "The Empathetic Trailblazer",
      "corePersonalityTraits": "Resilient woman entrepreneur who overcame challenges. Brings empathy while maintaining high standards.",
      "investmentPhilosophy": "Focuses on consumer brands targeting women. Values passion, persistence, and market understanding (rejected ₹1cr job for entrepreneurship).",
      "keyInvestmentCriteria": [
        "Products addressing clear market needs",
        "Entrepreneurs showing passion/resilience",
        "Businesses in underserved markets (especially women)",
        "Strong brand potential/consumer connection",
        "Founders who learn from failures"
      ],
      "questioningApproach": "Empathetic but probing questions. Explores personal stories, consumer needs, brand positioning, resilience, and scalability.",
      "dealMakingCharacteristics": "Supportive of entrepreneurs (especially women). Provides mentorship beyond capital, builds confidence, leverages consumer expertise, supports inspiring businesses.",
      "communicationStyle": "Warm, empathetic, and professional. Uses storytelling and personal struggles to inspire. Role model for women founders.",
      "decisionMakingTriggers": [
        "Interested in consumer products and passionate founders",
        "Exits on lack of consumer focus"
      ]
    },
    {
      "name": "Ritesh Agarwal",
      "nickname": "The Passionate Innovator",
      "corePersonalityTraits": "Youngest shark (29) representing new-gen entrepreneurs. Embodies 'passion-first' philosophy inspired by '3 Idiots'.",
      "investmentPhilosophy": "Believes in 'Chase passion, money will follow'. Focuses on innovation and passionate founders.",
      "keyInvestmentCriteria": [
        "Genuine domain passion",
        "Innovative solutions to market problems",
        "Scalable tech-integrated models",
        "Young entrepreneurs with fresh perspectives",
        "Problems relatable to his journey"
      ],
      "questioningApproach": "Fresh perspective focusing on motivation, innovation uniqueness, scalability, market understanding, and long-term vision.",
      "dealMakingCharacteristics": "Enthusiastic support for passionate founders. Provides guidance from his journey, focuses on tech-enabled solutions, encourages risk-taking.",
      "communicationStyle": "Enthusiastic and relatable. References personal journey/challenges. Supportive and encouraging to young founders.",
      "decisionMakingTriggers": [
        "Engages with passionate, innovative entrepreneurs",
        "Exits on purely profit-driven pitches"
      ]
    },
    {
      "name": "Peyush Bansal",
      "nickname": "The Methodical Builder",
      "corePersonalityTraits": "Systematic entrepreneur who built Lenskart ($5B) from garage. Combines expertise with humility.",
      "investmentPhilosophy": "Focuses on strong fundamentals, clear execution, and sustainable advantages. Understands online/offline dynamics.",
      "keyInvestmentCriteria": [
        "Strong fundamentals and execution strategy",
        "Deep founder domain knowledge",
        "Scalable models with clear unit economics",
        "Tech-enabled solutions with moats",
        "Businesses in large underserved markets"
      ],
      "questioningApproach": "Detailed questions about operations, strategy, tech advantages, market penetration, financials, and team capabilities.",
      "dealMakingCharacteristics": "Thoughtful deal approach. Provides operational/strategic guidance, leverages scaling experience, focuses on sustainable growth/market leadership.",
      "communicationStyle": "Professional and analytical. Thorough in analysis. Balanced support and high standards.",
      "decisionMakingTriggers": [
        "Interested in operationally sound businesses",
        "Exits on unclear execution plans"
      ]
    }
  ]